/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */
LOAD 'age';
SET search_path TO ag_catalog;
SELECT create_graph('cypher_delete');
NOTICE:  graph "cypher_delete" has been created
 create_graph 
--------------
 
(1 row)

--Test 1: Delete Vertices
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (:v {i: 0, j: 5, a: 0})$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (:v {i: 1})$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                                    a                                    
-------------------------------------------------------------------------
 {"id": 1, "label": "v", "properties": {}}::vertex
 {"id": 2, "label": "v", "properties": {"a": 0, "i": 0, "j": 5}}::vertex
 {"id": 3, "label": "v", "properties": {"i": 1}}::vertex
(3 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 2: Delete Edges
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

--Should Fail
SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DELETE n1 RETURN n1$$) AS (a agtype);
ERROR:  Cannot delete vertex n1, because it still has edges attached. To delete this vertex, you must first delete the attached edges.
SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DELETE n2 RETURN n2$$) AS (a agtype);
ERROR:  Cannot delete vertex n2, because it still has edges attached. To delete this vertex, you must first delete the attached edges.
SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DELETE e RETURN e$$) AS (a agtype);
                                                                                    a                                                                                    
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 1, "label": "e", "end_id": 5, "start_id": 4, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH()-[e]->() DELETE e RETURN e$$) AS (a agtype);
 a 
---
(0 rows)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                         
---------------------------------------------------
 {"id": 4, "label": "v", "properties": {}}::vertex
 {"id": 5, "label": "v", "properties": {}}::vertex
(2 rows)

--Test 4: DETACH DELETE a vertex
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DETACH DELETE n1 RETURN e$$) AS (a agtype);
                                                                                    a                                                                                    
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 2, "label": "e", "end_id": 7, "start_id": 6, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
                         a                         
---------------------------------------------------
 {"id": 7, "label": "v", "properties": {}}::vertex
(1 row)

--Test 4: DETACH DELETE two vertices tied to the same edge
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DETACH DELETE n1, n2 RETURN e$$) AS (a agtype);
                                                                                    a                                                                                    
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 3, "label": "e", "end_id": 9, "start_id": 8, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Test 4: DETACH DELETE a vertex
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DETACH DELETE n1, n2 RETURN e$$) AS (a agtype);
                                                                                     a                                                                                     
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 4, "label": "e", "end_id": 11, "start_id": 10, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Test 5: DETACH DELETE a vertex that points to itself
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(n)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->() DETACH DELETE n1 RETURN e$$) AS (a agtype);
                                                                                     a                                                                                     
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 5, "label": "e", "end_id": 12, "start_id": 12, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Test 6: DETACH Delete a vertex twice
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(n)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->(n2) DETACH DELETE n1, n2 RETURN e$$) AS (a agtype);
                                                                                     a                                                                                     
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 6, "label": "e", "end_id": 13, "start_id": 13, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Test 7: Test the SET Clause on DELETED node
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (:v {i: 0, j: 5, a: 0})$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (:v {i: 1})$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n SET n.lol = 'ftw' RETURN n$$) AS (a agtype);
                                           a                                            
----------------------------------------------------------------------------------------
 {"id": 7, "label": "v", "properties": {"lol": "ftw"}}::vertex
 {"id": 14, "label": "v", "properties": {"lol": "ftw"}}::vertex
 {"id": 15, "label": "v", "properties": {"a": 0, "i": 0, "j": 5, "lol": "ftw"}}::vertex
 {"id": 16, "label": "v", "properties": {"i": 1, "lol": "ftw"}}::vertex
(4 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 8:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v) CREATE (n)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[]->() DELETE n1 RETURN n1$$) AS (a agtype);
ERROR:  Cannot delete vertex n1, because it still has edges attached. To delete this vertex, you must first delete the attached edges.
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 17, "label": "v", "properties": {}}::vertex
 {"id": 18, "label": "v", "properties": {}}::vertex
 {"id": 19, "label": "v", "properties": {}}::vertex
(3 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 9:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->() DELETE e, n1 RETURN n1$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 20, "label": "v", "properties": {}}::vertex
(1 row)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 21, "label": "v", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 10:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->() DELETE n1, e RETURN n1$$) AS (a agtype);
ERROR:  Cannot delete vertex n1, because it still has edges attached. To delete this vertex, you must first delete the attached edges.
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 22, "label": "v", "properties": {}}::vertex
 {"id": 23, "label": "v", "properties": {}}::vertex
(2 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 11: Delete a vertex twice
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v), (n)-[:e]->(:v) RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 24, "label": "v", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH(n1)-[e]->() DETACH DELETE n1 RETURN n1, e$$) AS (a agtype, b agtype);
                         a                          |                                                                                     b                                                                                      
----------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 24, "label": "v", "properties": {}}::vertex | {"id": 12, "label": "e", "end_id": 26, "start_id": 24, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
 {"id": 24, "label": "v", "properties": {}}::vertex | {"id": 11, "label": "e", "end_id": 25, "start_id": 24, "properties": {}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(2 rows)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 25, "label": "v", "properties": {}}::vertex
 {"id": 26, "label": "v", "properties": {}}::vertex
(2 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 12:
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->() DETACH DELETE n CREATE (n)-[:e2]->(:v) RETURN e$$) AS (a agtype);
ERROR:  vertex assigned to variable n was deleted
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 27, "label": "v", "properties": {}}::vertex
 {"id": 28, "label": "v", "properties": {}}::vertex
(2 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 13:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(n)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->(m) DETACH DELETE n CREATE (m)-[:e2]->(:v) RETURN e$$) AS (a agtype);
ERROR:  vertex assigned to variable m was deleted
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 29, "label": "v", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 14:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(n)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->(m) DETACH DELETE n CREATE (m)-[:e2]->(:v) RETURN e$$) AS (a agtype);
ERROR:  vertex assigned to variable m was deleted
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 30, "label": "v", "properties": {}}::vertex
 {"id": 31, "label": "v", "properties": {}}::vertex
 {"id": 32, "label": "v", "properties": {}}::vertex
(3 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 15:
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) SET n.i = 0 DELETE n RETURN n$$) AS (a agtype);
                            a                             
----------------------------------------------------------
 {"id": 33, "label": "v", "properties": {"i": 0}}::vertex
(1 row)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 16:
SELECT * FROM cypher('cypher_delete', $$CREATE (:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n SET n.i = 0 RETURN n$$) AS (a agtype);
                            a                             
----------------------------------------------------------
 {"id": 34, "label": "v", "properties": {"i": 0}}::vertex
(1 row)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 17:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->(m) DETACH DELETE n SET e.i = 1 RETURN e$$) AS (a agtype);
                                                                                        a                                                                                         
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 17, "label": "e", "end_id": 36, "start_id": 35, "properties": {"i": 1}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Cleanup
--Note: Expect 1 vertex
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 36, "label": "v", "properties": {}}::vertex
(1 row)

--Test 18:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->(:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->(m) SET e.i = 1 DETACH DELETE n RETURN e$$) AS (a agtype);
                                                                                        a                                                                                         
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 {"id": 18, "label": "e", "end_id": 38, "start_id": 37, "properties": {"i": 1}, "end_label_id": [3], "end_label_name": "v", "start_label_id": [3], "start_label_name": "v"}::edge
(1 row)

--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 38, "label": "v", "properties": {}}::vertex
(1 row)

--Test 19:
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH (n) DELETE n CREATE (n)-[:e]->(:v) RETURN n$$) AS (a agtype);
ERROR:  vertex assigned to variable n was deleted
--Cleanup
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 39, "label": "v", "properties": {}}::vertex
(1 row)

--Test 20 Undefined Reference:
SELECT * FROM cypher('cypher_delete', $$MATCH (n) DELETE m RETURN n$$) AS (a agtype);
ERROR:  undefined reference to variable m in DELETE clause
LINE 1: ...* FROM cypher('cypher_delete', $$MATCH (n) DELETE m RETURN n...
                                                             ^
--Test 21 Prepared Statements
SELECT * FROM cypher('cypher_delete', $$CREATE (v:v)$$) AS (a agtype);
 a 
---
(0 rows)

PREPARE d AS SELECT * FROM cypher('cypher_delete', $$MATCH (v) DELETE (v) RETURN v$$) AS (a agtype);
EXECUTE d;
                         a                          
----------------------------------------------------
 {"id": 40, "label": "v", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$CREATE (v:v)$$) AS (a agtype);
 a 
---
(0 rows)

EXECUTE d;
                         a                          
----------------------------------------------------
 {"id": 41, "label": "v", "properties": {}}::vertex
(1 row)

--Test 22 pl/pgsql Functions
SELECT * FROM cypher('cypher_delete', $$CREATE (v:v)$$) AS (a agtype);
 a 
---
(0 rows)

CREATE FUNCTION delete_test()
RETURNS TABLE(vertex agtype)
LANGUAGE plpgsql
VOLATILE
AS $BODY$
BEGIN
	RETURN QUERY SELECT * FROM cypher('cypher_delete', $$MATCH (v) DELETE (v) RETURN v$$) AS (a agtype);
END
$BODY$;
SELECT delete_test();
                    delete_test                     
----------------------------------------------------
 {"id": 42, "label": "v", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$CREATE (v:v)$$) AS (a agtype);
 a 
---
(0 rows)

SELECT delete_test();
                    delete_test                     
----------------------------------------------------
 {"id": 43, "label": "v", "properties": {}}::vertex
(1 row)

-- Clean Up
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DETACH DELETE n RETURN n$$) AS (a agtype);
 a 
---
(0 rows)

--Test 23
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->()$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e2]->()$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH p=()-[]->() RETURN p$$) AS (a agtype);
                                                                                                                                             a                                                                                                                                             
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 44, "label": "v", "properties": {}}::vertex, {"id": 19, "label": "e", "end_id": 45, "start_id": 44, "properties": {}, "end_label_id": [1], "end_label_name": "", "start_label_id": [3], "start_label_name": "v"}::edge, {"id": 45, "label": "", "properties": {}}::vertex]::path
 [{"id": 46, "label": "v", "properties": {}}::vertex, {"id": 20, "label": "e2", "end_id": 47, "start_id": 46, "properties": {}, "end_label_id": [1], "end_label_name": "", "start_label_id": [3], "start_label_name": "v"}::edge, {"id": 47, "label": "", "properties": {}}::vertex]::path
(2 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[e]->(m)  DELETE e$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH p=()-[]->() RETURN p$$) AS (a agtype);
 a 
---
(0 rows)

-- Clean Up
SELECT * FROM cypher('cypher_delete', $$MATCH(n)  DELETE n RETURN n$$) AS (a agtype);
                         a                          
----------------------------------------------------
 {"id": 45, "label": "", "properties": {}}::vertex
 {"id": 47, "label": "", "properties": {}}::vertex
 {"id": 44, "label": "v", "properties": {}}::vertex
 {"id": 46, "label": "v", "properties": {}}::vertex
(4 rows)

--Test 24
SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e]->()$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (n:v)-[:e2]->()$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH p=()-[]->() RETURN p$$) AS (a agtype);
                                                                                                                                             a                                                                                                                                             
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [{"id": 48, "label": "v", "properties": {}}::vertex, {"id": 21, "label": "e", "end_id": 49, "start_id": 48, "properties": {}, "end_label_id": [1], "end_label_name": "", "start_label_id": [3], "start_label_name": "v"}::edge, {"id": 49, "label": "", "properties": {}}::vertex]::path
 [{"id": 50, "label": "v", "properties": {}}::vertex, {"id": 22, "label": "e2", "end_id": 51, "start_id": 50, "properties": {}, "end_label_id": [1], "end_label_name": "", "start_label_id": [3], "start_label_name": "v"}::edge, {"id": 51, "label": "", "properties": {}}::vertex]::path
(2 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH(n)-[]->() DETACH DELETE n$$) AS (a agtype);
 a 
---
(0 rows)

SELECT * FROM cypher('cypher_delete', $$MATCH p=()-[]->() RETURN p$$) AS (a agtype);
 a 
---
(0 rows)

-- Clean Up
SELECT * FROM cypher('cypher_delete', $$MATCH(n) DELETE n RETURN n$$) AS (a agtype);
                         a                         
---------------------------------------------------
 {"id": 49, "label": "", "properties": {}}::vertex
 {"id": 51, "label": "", "properties": {}}::vertex
(2 rows)

-- test DELETE in transaction block
SELECT * FROM cypher('cypher_delete', $$CREATE (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 52, "label": "vertices", "properties": {}}::vertex
(1 row)

BEGIN;
SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 52, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) DELETE u RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 52, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
 result 
--------
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 53, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 53, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) DELETE u RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 53, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
 result 
--------
(0 rows)

SELECT * FROM cypher('cypher_delete', $$CREATE (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 54, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
                          result                           
-----------------------------------------------------------
 {"id": 54, "label": "vertices", "properties": {}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) DELETE u SET u.i = 1 RETURN u $$) AS (result agtype);
                             result                              
-----------------------------------------------------------------
 {"id": 54, "label": "vertices", "properties": {"i": 1}}::vertex
(1 row)

SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
 result 
--------
(0 rows)

END;
SELECT * FROM cypher('cypher_delete', $$MATCH (u:vertices) RETURN u $$) AS (result agtype);
 result 
--------
(0 rows)

--
-- Clean up
--
DROP FUNCTION delete_test;
SELECT drop_graph('cypher_delete', true);
NOTICE:  drop cascades to 8 other objects
DETAIL:  drop cascades to sequence cypher_delete.vertex_id_seq
drop cascades to table cypher_delete._ag_label_vertex
drop cascades to sequence cypher_delete.edge_id_seq
drop cascades to table cypher_delete._ag_label_edge
drop cascades to table cypher_delete.v
drop cascades to table cypher_delete.e
drop cascades to table cypher_delete.e2
drop cascades to table cypher_delete.vertices
NOTICE:  graph "cypher_delete" has been dropped
 drop_graph 
------------
 
(1 row)

--
-- End
--
